bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1284RFR2.xml
                <register caption="Timer/Counter5 Control Register B" name="TCCR5B" offset="0x121" size="1">
                    <bitfield caption="Input Capture 5 Noise Canceller" mask="0x80" name="ICNC5"/>
                    <bitfield caption="Input Capture 5 Edge Select" mask="0x40" name="ICES5"/>
                    <bitfield caption="Reserved Bit" mask="0x20" name="Res"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM5" values="TC1_WGMX_BITF"
                              lsb="2"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS5" values="CLK_SEL_3BIT_NOEXT_MEGARF"/>
                </register>
                <register caption="Timer/Counter5 Control Register C" name="TCCR5C" offset="0x122" size="1">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC5A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC5B"/>
                    <bitfield caption="Force Output Compare for Channel C" mask="0x20" name="FOC5C"/>
                    <bitfield caption="Reserved" mask="0x1F" name="Res"/>
                </register>
                <register caption="Timer/Counter5 Bytes" name="TCNT5" offset="0x124" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register A Bytes" name="OCR5A" offset="0x128" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register B Bytes" name="OCR5B" offset="0x12A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Output Compare Register C Bytes" name="OCR5C" offset="0x12C" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Input Capture Register Bytes" name="ICR5" offset="0x126" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter5 Interrupt Mask Register" name="TIMSK5" offset="0x73" size="1">
                    <bitfield caption="Timer/Counter5 Input Capture Interrupt Enable" mask="0x20" name="ICIE5"/>
                    <bitfield caption="Timer/Counter5 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE5C"/>
                    <bitfield caption="Timer/Counter5 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE5B"/>
                    <bitfield caption="Timer/Counter5 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE5A"/>
                    <bitfield caption="Timer/Counter5 Overflow Interrupt Enable" mask="0x01" name="TOIE5"/>
                </register>
                <register caption="Timer/Counter5 Interrupt Flag Register" name="TIFR5" offset="0x3A" size="1"
                          ocd-rw="">
                    <bitfield caption="Timer/Counter5 Input Capture Flag" mask="0x20" name="ICF5"/>
                    <bitfield caption="Timer/Counter5 Output Compare C Match Flag" mask="0x08" name="OCF5C"/>
                    <bitfield caption="Timer/Counter5 Output Compare B Match Flag" mask="0x04" name="OCF5B"/>
                    <bitfield caption="Timer/Counter5 Output Compare A Match Flag" mask="0x02" name="OCF5A"/>
                    <bitfield caption="Timer/Counter5 Overflow Flag" mask="0x01" name="TOV5"/>
                </register>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC4">
                <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xA0" size="1">
                    <bitfield caption="Compare Output Mode for Channel A" mask="0xC0" name="COM4A"
                              values="TC4_COMNX_BITF"/>
                    <bitfield caption="Compare Output Mode for Channel B" mask="0x30" name="COM4B"
                              values="TC4_COMNX_BITF"/>
                    <bitfield caption="Compare Output Mode for Channel C" mask="0x0C" name="COM4C"
                              values="TC4_COMNX_BITF"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM4" values="TC1_WGMX_BITF"/>
                </register>
                <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xA1" size="1">
                    <bitfield caption="Input Capture 4 Noise Canceller" mask="0x80" name="ICNC4"/>
                    <bitfield caption="Input Capture 4 Edge Select" mask="0x40" name="ICES4"/>
                    <bitfield caption="Reserved Bit" mask="0x20" name="Res"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM4" values="TC1_WGMX_BITF"
                              lsb="2"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS4" values="CLK_SEL_3BIT_NOEXT_MEGARF"/>
                </register>
                <register caption="Timer/Counter4 Control Register C" name="TCCR4C" offset="0xA2" size="1">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC4A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC4B"/>
                    <bitfield caption="Force Output Compare for Channel C" mask="0x20" name="FOC4C"/>
                    <bitfield caption="Reserved" mask="0x1F" name="Res"/>
                </register>
                <register caption="Timer/Counter4 Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register A Bytes" name="OCR4A" offset="0xA8" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register B Bytes" name="OCR4B" offset="0xAA" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register C Bytes" name="OCR4C" offset="0xAC" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Input Capture Register Bytes" name="ICR4" offset="0xA6" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
                    <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
                    <bitfield caption="Timer/Counter4 Output Compare C Match Interrupt Enable" mask="0x08"
                              name="OCIE4C"/>
                    <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE4B"/>
                    <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
                </register>
