bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1284RFR2.xml
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)"
                          name="MAFPA0H" offset="0x111" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 0" mask="0xFF"
                              name="MAFPA0H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)" name="MAFSA1L"
                          offset="0x112" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 1" mask="0xFF" name="MAFSA1L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)" name="MAFSA1H"
                          offset="0x113" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 1" mask="0xFF" name="MAFSA1H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)"
                          name="MAFPA1L" offset="0x114" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 1" mask="0xFF"
                              name="MAFPA1L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)"
                          name="MAFPA1H" offset="0x115" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 1" mask="0xFF"
                              name="MAFPA1H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 2 (Low Byte)" name="MAFSA2L"
                          offset="0x116" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 2" mask="0xFF" name="MAFSA2L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 2 (High Byte)" name="MAFSA2H"
                          offset="0x117" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 2" mask="0xFF" name="MAFSA2H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 2 (Low Byte)"
                          name="MAFPA2L" offset="0x118" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 2" mask="0xFF"
                              name="MAFPA2L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 2 (High Byte)"
                          name="MAFPA2H" offset="0x119" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 2" mask="0xFF"
                              name="MAFPA2H"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 3 (Low Byte)" name="MAFSA3L"
                          offset="0x11A" size="1">
                    <bitfield caption="MAC Short Address low Byte for Frame Filter 3" mask="0xFF" name="MAFSA3L"/>
                </register>
                <register caption="Transceiver MAC Short Address Register for Frame Filter 3 (High Byte)" name="MAFSA3H"
                          offset="0x11B" size="1">
                    <bitfield caption="MAC Short Address high Byte for Frame Filter 3" mask="0xFF" name="MAFSA3H"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 3 (Low Byte)"
                          name="MAFPA3L" offset="0x11C" size="1">
                    <bitfield caption="MAC Personal Area Network ID low Byte for Frame Filter 3" mask="0xFF"
                              name="MAFPA3L"/>
                </register>
                <register caption="Transceiver Personal Area Network ID Register for Frame Filter 3 (High Byte)"
                          name="MAFPA3H" offset="0x11D" size="1">
                    <bitfield caption="MAC Personal Area Network ID high Byte for Frame Filter 3" mask="0xFF"
                              name="MAFPA3H"/>
                </register>
                <register caption="Multiple Address Filter Configuration Register 0" name="MAFCR0" offset="0x10C"
                          size="1">
                    <bitfield caption="Reserved Bit" mask="0xF0" name="Res"/>
                    <bitfield caption="Multiple Address Filter 3 Enable" mask="0x08" name="MAF3EN"/>
                    <bitfield caption="Multiple Address Filter 2 Enable" mask="0x04" name="MAF2EN"/>
                    <bitfield caption="Multiple Address Filter 1 Enable" mask="0x02" name="MAF1EN"/>
                    <bitfield caption="Multiple Address Filter 0 Enable" mask="0x01" name="MAF0EN"/>
                </register>
                <register caption="Multiple Address Filter Configuration Register 1" name="MAFCR1" offset="0x10D"
                          size="1">
                    <bitfield caption="Set Data Pending bit for address filter 3." mask="0x80" name="AACK_3_SET_PD"/>
                    <bitfield caption="Enable PAN Coordinator mode for address filter 3." mask="0x40"
                              name="AACK_3_I_AM_COORD"/>
                    <bitfield caption="Set Data Pending bit for address filter 2." mask="0x20" name="AACK_2_SET_PD"/>
                    <bitfield caption="Enable PAN Coordinator mode for address filter 2." mask="0x10"
                              name="AACK_2_I_AM_COORD"/>
                    <bitfield caption="Set Data Pending bit for address filter 1." mask="0x08" name="AACK_1_SET_PD"/>
                    <bitfield caption="Enable PAN Coordinator mode for address filter 1." mask="0x04"
                              name="AACK_1_I_AM_COORD"/>
                    <bitfield caption="Set Data Pending bit for address filter 0." mask="0x02" name="AACK_0_SET_PD"/>
                    <bitfield caption="Enable PAN Coordinator mode for address filter 0." mask="0x01"
                              name="AACK_0_I_AM_COORD"/>
                </register>
                <register caption="AES Control Register" name="AES_CTRL" offset="0x13C" size="1">
                    <bitfield caption="Request AES Operation." mask="0x80" name="AES_REQUEST"/>
                    <bitfield caption="Set AES Operation Mode" mask="0x20" name="AES_MODE" values="AES_MODE_BITF"/>
                    <bitfield caption="Set AES Operation Direction" mask="0x08" name="AES_DIR"
                              values="AES_DIRECTION_BITF"/>
                    <bitfield caption="AES Interrupt Enable" mask="0x04" name="AES_IM"/>
                </register>
                <register caption="AES Status Register" name="AES_STATUS" offset="0x13D" size="1" ocd-rw="R">
                    <bitfield caption="AES Operation Finished with Error" mask="0x80" name="AES_ER"/>
                    <bitfield caption="Reserved" mask="0x7E" name="Res"/>
                    <bitfield caption="AES Operation Finished with Success" mask="0x01" name="AES_DONE"/>
                </register>
                <register caption="AES Plain and Cipher Text Buffer Register" name="AES_STATE" offset="0x13E" size="1">
                    <bitfield caption="AES Plain and Cipher Text Buffer" mask="0xFF" name="AES_STATE"/>
                </register>
