bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA1284RFR2.xml
                <register caption="Transceiver CSMA-CA Back-off Exponent Control Register" name="CSMA_BE" offset="0x16F"
                          size="1">
                    <bitfield caption="Maximum Back-off Exponent" mask="0xF0" name="MAX_BE" values="MAX_BE_bitf"/>
                    <bitfield caption="Minimum Back-off Exponent" mask="0x0F" name="MIN_BE" values="MIN_BE_bitf"/>
                </register>
                <register caption="Transceiver Digital Test Control Register" name="TST_CTRL_DIGI" offset="0x176"
                          size="1">
                    <bitfield caption="Digital Test Controller Register" mask="0x0F" name="TST_CTRL_DIG"
                              values="TST_CTRL_DIG_BITF"/>
                </register>
                <register caption="Transceiver Received Frame Length Register" name="TST_RX_LENGTH" offset="0x17B"
                          size="1">
                    <bitfield caption="Received Frame Length" mask="0xFF" name="RX_LENGTH"/>
                </register>
                <register caption="Start of frame buffer" name="TRXFBST" offset="0x180" size="1" mask="0xFF"/>
                <register caption="End of frame buffer" name="TRXFBEND" offset="0x1FF" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="PALTD_bitf">
                <value caption="-3us" name="PALTD_MINUS_3US" value="0"/>
                <value caption="-2us" name="PALTD_MINUS_2US" value="1"/>
                <value caption="-1us" name="PALTD_MINUS_1US" value="2"/>
                <value caption="0us" name="PALTD_0US" value="3"/>
                <value caption="1us" name="PALTD_1US" value="4"/>
                <value caption="2us" name="PALTD_2US" value="5"/>
                <value caption="3us" name="PALTD_3US" value="6"/>
                <value caption="4us" name="PALTD_4US" value="7"/>
            </value-group>
            <value-group caption="" name="PALTU_bitf">
                <value caption="-3us" name="PALTU_MINUS_3US" value="0"/>
                <value caption="-2us" name="PALTU_MINUS_2US" value="1"/>
                <value caption="-1us" name="PALTU_MINUS_1US" value="2"/>
                <value caption="0us" name="PALTU_0US" value="3"/>
                <value caption="1us" name="PALTU_1US" value="4"/>
                <value caption="2us" name="PALTU_2US" value="5"/>
                <value caption="3us" name="PALTU_3US" value="6"/>
                <value caption="4us" name="PALTU_4US" value="7"/>
            </value-group>
            <value-group caption="" name="AES_MODE_BITF">
                <value caption="AES Mode is ECB (Electronic Code Book)." name="AES_MODE_ECB" value="0"/>
                <value caption="AES Mode is CBC (Cipher Block Chaining)." name="AES_MODE_CBC" value="1"/>
            </value-group>
            <value-group caption="" name="AES_DIRECTION_BITF">
                <value caption="AES operation is encryption." name="AES_DIR_ENC" value="0"/>
                <value caption="AES operation is decryption." name="AES_DIR_DEC" value="1"/>
            </value-group>
            <value-group caption="" name="CCA_DONE_bitf">
                <value caption="CCA calculation not finished" name="CCA_NOT_FIN" value="0"/>
                <value caption="CCA calculation finished" name="CCA_FIN" value="1"/>
            </value-group>
            <value-group caption="" name="CCA_STATUS_bitf">
                <value caption="Channel indicated as busy." name="CCA_BUSY" value="0"/>
                <value caption="Channel indicated as idle." name="CCA_IDLE" value="1"/>
            </value-group>
            <value-group caption="" name="TST_STATUS_bitf">
                <value caption="Test mode is disabled." name="TST_DISABLED" value="0"/>
                <value caption="Test mode is active." name="TST_ENABLED" value="1"/>
            </value-group>
            <value-group caption="" name="TRX_STATUS_bitf">
                <value caption="P_ON" name="P_ON" value="0x00"/>
                <value caption="BUSY_RX" name="BUSY_RX" value="0x01"/>
                <value caption="BUSY_TX" name="BUSY_TX" value="0x02"/>
                <value caption="RX_ON" name="RX_ON" value="0x06"/>
                <value caption="TRX_OFF" name="TRX_OFF" value="0x08"/>
                <value caption="PLL_ON" name="PLL_ON" value="0x09"/>
                <value caption="SLEEP" name="SLEEP" value="0x0F"/>
                <value caption="BUSY_RX_AACK" name="BUSY_RX_AACK" value="0x11"/>
                <value caption="BUSY_TX_ARET" name="BUSY_TX_ARET" value="0x12"/>
                <value caption="RX_AACK_ON" name="RX_AACK_ON" value="0x16"/>
                <value caption="TX_ARET_ON" name="TX_ARET_ON" value="0x19"/>
                <value caption="STATE_TRANSITION_IN_PROGRESS" name="STATE_TRANSITION_IN_PROGRESS" value="0x1F"/>
            </value-group>
            <value-group caption="" name="TRAC_STATUS_bitf">
                <value caption="SUCCESS (RX_AACK, TX_ARET)" name="TRAC_SUCCESS" value="0"/>
                <value caption="SUCCESS_DATA_PENDING (TX_ARET)" name="TRAC_SUCCESS_DATA_PENDING" value="1"/>
                <value caption="SUCCESS_WAIT_FOR_ACK (RX_AACK)" name="TRAC_SUCCESS_WAIT_FOR_ACK" value="2"/>
                <value caption="CHANNEL_ACCESS_FAILURE (TX_ARET)" name="TRAC_CHANNEL_ACCESS_FAILURE" value="3"/>
                <value caption="NO_ACK (TX_ARET)" name="TRAC_NO_ACK" value="5"/>
                <value caption="INVALID (RX_AACK, TX_ARET)" name="TRAC_INVALID" value="7"/>
            </value-group>
            <value-group caption="" name="TRX_CMD_bitf">
                <value caption="NOP" name="CMD_NOP" value="0x00"/>
                <value caption="TX_START" name="CMD_TX_START" value="0x02"/>
                <value caption="FORCE_TRX_OFF" name="CMD_FORCE_TRX_OFF" value="0x03"/>
                <value caption="FORCE_PLL_ON" name="CMD_FORCE_PLL_ON" value="0x04"/>
                <value caption="RX_ON" name="CMD_RX_ON" value="0x06"/>
                <value caption="TRX_OFF" name="CMD_TRX_OFF" value="0x08"/>
                <value caption="PLL_ON (TX_ON)" name="CMD_PLL_ON" value="0x09"/>
                <value caption="RX_AACK_ON" name="CMD_RX_AACK_ON" value="0x16"/>
                <value caption="TX_ARET_ON" name="CMD_TX_ARET_ON" value="0x19"/>
            </value-group>
            <value-group caption="" name="TX_PWR_bitf">
                <value caption="3.5 dBm" name="VAL_0" value="0"/>
                <value caption="3.3 dBm" name="VAL_1" value="1"/>
                <value caption="2.8 dBm" name="VAL_2" value="2"/>
                <value caption="2.3 dBm" name="VAL_3" value="3"/>
                <value caption="1.8 dBm" name="VAL_4" value="4"/>
                <value caption="1.2 dBm" name="VAL_5" value="5"/>
                <value caption="0.5 dBm" name="VAL_6" value="6"/>
                <value caption="-0.5 dBm" name="VAL_7" value="7"/>
                <value caption="-1.5 dBm" name="VAL_8" value="8"/>
                <value caption="-2.5 dBm" name="VAL_9" value="9"/>
                <value caption="-3.5 dBm" name="VAL_10" value="10"/>
                <value caption="-4.5 dBm" name="VAL_11" value="11"/>
                <value caption="-6.5 dBm" name="VAL_12" value="12"/>
                <value caption="-8.5 dBm" name="VAL_13" value="13"/>
                <value caption="-11.5 dBm" name="VAL_14" value="14"/>
                <value caption="-16.5 dBm" name="VAL_15" value="15"/>
            </value-group>
            <value-group caption="" name="RX_CRC_VALID_bitf">
                <value caption="CRC (FCS) not valid" name="CRC_INVALID" value="0"/>
                <value caption="CRC (FCS) valid" name="CRC_VALID" value="1"/>
            </value-group>
